module.exports.config = {
	name: "propose",
	version: "1.0.2",
	permission: 0,
	credits: "NAFIJ_PRO",
	prefix: false,
	description: "",
	category: "without prefix",
	usages: "[tag]",
	cooldowns: 5
};


module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("Eije Madam Suno. Ami Nafij Tomake Kichu Kotha bolbo. Mon Dia Sunba.❤️");
setTimeout(() => {a({body: "শুনো প্রিয় খুব ভালো বাসি তোমায় 🥰।" })}, 2000);
setTimeout(() => {a({body: "Tumake dekhle Amar Kemon Jeno lage☹️❤️" })}, 5000);
setTimeout(() => {a({body: "তোমার সঙ্গে একবার কথা না বল্লে আমার মনটা কেমন জানি করে☺️" })}, 7000);
setTimeout(() => {a({body: "Ami Tomake Onk Valobashi 💗❤️" })}, 9000);
setTimeout(() => {a({body: "তুমি আমায় কি করলে তোমাকে ছাড়া আমি কিছু বুঝিনা কেন এই মন শুধু খোঁজে তোমাকে সারাক্ষণ😒" })}, 11000);
setTimeout(() => {a({body: "Tomake dekhle amar mon kharap thakleo valo hoye jai 🙂💗" })}, 13000);
setTimeout(() => {a({body: "তোমার চিন্তা আমার মন থেকে কখনই যাবে না 🙂 কারণ তুমি আমার চিন্তার চিন্তায় মিশে আছো💚" })}, 15000);
setTimeout(() => {a({body: "🌚😻Tumi Onk SunDor Tomake Prothom Dekhe E amar Valo Legese.💕❤️" })}, 20000);
setTimeout(() => {a({body: "অন্য কিছু আমি চাই না কারণ আমি তোমাকে পেয়েছি\n\nস্বপ্ন আমি দেখতে চাই না কারণ তুমিই আমার স্বপ্ন🥀🥰💚" })}, 23000);
setTimeout(() => {a({body: "Ami Tomake amar Moner Manus Banate chay💗😐" })}, 25000);
setTimeout(() => {a({body: "যখন থেকে পরী হয়ে বাসা বেধেঁছ আমার চোখে,\n\n তখন থেকে তুমি ছাড়া আর কিছুই ভালো লাগেনা❤️" })}, 28500);
setTimeout(() => {a({body: "Tumi Ki Amar Hoba😕💗" })}, 31000);
setTimeout(() => {a({body: "তুমি এত সুন্দর কেন আমি যে তোমায় না দেখে থাকতে পারি না😻🥰💚 " })}, 36000);
setTimeout(() => {a({body: "Tumi Jodi Amake Na valo Basho Tao amar kono somossa nai 💗😅 Tobe Ami Tomake Valobashi💗" })}, 39000);
setTimeout(() => {a({body: "তোমাকে দেখলে আমার এত ভালো লাগে কেন জান আমি কিছুই তো বুঝতে পারি না💚" })}, 40000);
setTimeout(() => {a({body: "Tomake Chara Ak Muhurto O Vabte Parina💗😅" })}, 45000);
setTimeout(() => {a({body: "যদি তুমি মনে করো সুখে নেই তবে তুমি ফিরে আসো আমার বুকে এখনো আগ্লে রাখবো তোমাকে!!💚" })}, 47000);
setTimeout(() => {a({body: "I Really Really Love You👽. I can't stay without You🌚.Tumak chara Ami osohaiiiiiii 😦😦" })}, 49000);
setTimeout(() => {a({body: "তোমাকে সব সময় পাশে চাই হয় এপারে না হয় ওপারে ⚜— -!!" })}, 51000);
setTimeout(() => {a({body: "Priyo Tumi ki Amar Hoba Please.💗😕" })}, 53000);
setTimeout(() => {a({body: "༉༎༉😽!!লাইন টা তুমার জন্য  ডুবেছি আমি তুমার প্রেমের অনন্ত মায়ায় 🙈 ༅༎•❤️🌸" })}, 56000);
setTimeout(() => {a({body: "I Really Really Love you💗😕" })}, 58000);
setTimeout(() => {a({body: "দিন শেষে আমার তোমাকেই লাগবে😽" })}, 60000);
setTimeout(() => {a({body: "Ami Tomake Amar Bou Banaite chay💗😷" })}, 62000);
setTimeout(() => {a({body: "🖤এক আকাশ সমান স্বপ্ন নিয়েতোমাকে ভালোবাসি প্রিয়🐰🦋🥰" })}, 65000);
setTimeout(() => {a({body: "লাস্ট এতোটুকই বলবো থাক বেশি হইয়া গেছে 🌚 আপনাকে এসব আমি এমনি বলি নাই নাফিজ ভাই বলতে বলসে সব 🌝🌚" })}, 67000);
setTimeout(() => {a({body: "Sob Nafij Vai Bolse 🐸" })}, 69000);
setTimeout(() => {a({body: "Amar Kono Dosh Nai😬🐸" })}, 70000);
setTimeout(() => {a({body: "Ar Hea Vai Apnake Onek Valobashe Accept Koren ♡💗👀" })}, 72000);
setTimeout(() => {a({body: "Eituku Bolar Chilo Kisu Vul Bolle Maf Kore Diyen😒👏" })}, 74000);


  
  }